
#? Задача №39. Даны два массива чисел. Требуется вывести те элементы первого массива 
#? (в том порядке, в каком они идут в первом массиве), которых нет во втором массиве. 
#? Пользователь вводит  число N - количество элементов в первом массиве, затем N чисел - элементы массива. 
#? Затем число M - количество элементов во втором массиве. Затем элементы второго  массива
#? Ввод: 7 - 3 1 3 4 2 4 12 
#?       6 - 4 15 43 1 15 1 
#? Вывод: 3 3 2 12 
#? (каждое число вводится с новой строки)
'''
n = int(input('Введите длину первого массива: '))
array_1 = [int(input('Введите элементы массивна: ')) for _ in range(n)]
m = int(input('Введите длину второго массива: '))
array_2 = [int(input('Введите элементы массивна: ')) for _ in range(m)]
print(array_1)
print(array_2)

new_array = []
for i in array_1:
    if i not in array_2:
        new_array.append(i)

print(new_array)
'''

#? Задача №41. Дан массив, состоящий из целых чисел. Напишите программу, которая 
#? в данном массиве определит количество элементов, у которых два соседних и, при этом, 
#? оба соседних элемента меньше данного. Сначала вводится число N — количество элементов в массиве  
#? Далее записаны N чисел — элементы массива. Массив состоит из целых чисел. 
#? Ввод: 5 - 1 2 3 4 5
#? Вывод:0
#? Ввод: 5 - 1 5 1 5 1
#? Вывод: 2 
#? (каждое число вводится с новой строки)
'''
n = int(input('Введите длину массива: '))
array = [int(input('Введите элементы массивна: ')) for _ in range(n)]
print(*array)

count = 0
for i in range(1, len(array) - 1):
    if array[i] > array[i - 1] and array[i] > array [i + 1]:
        count += 1
print(count)
'''

#? Задача №43. Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. 
#? Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать. 
#? Вводится список чисел. Все числа списка находятся на разных строках. 
#? Ввод: 1 2 3 2 3
#? Вывод: 2

#! n = int(input('Введите длину массива: '))
#! array = [int(input('Введите элементы массивна: ')) for _ in range(n)]
#! print(*array)

#! count = 0
#! pair = 0
#! for i in range(len(array)):
#!     for i in range(len(array)):
#!         if array[i] == array[i]:
#!             count+=1
#!     pair+=1

#! print(count)
#! print(pair)


#? Задача №45. Два различных натуральных числа n и m называются дружественными, 
#? если сумма делителей числа n (включая 1, но исключая само n) равна числу m и наоборот. 
#? Например, 220 и 284 – дружественные числа. 
#? По данному числу k выведите все пары дружественных чисел, каждое из которых не превосходит k. 
#? Программа получает на вход одно натуральное число k, не превосходящее 105. 
#? Программа должна вывести  все пары дружественных чисел, каждое из которых не превосходит k. 
#? Пары необходимо выводить по одной в строке, разделяя пробелами. 
#? Каждая пара должна быть выведена только один раз (перестановка чисел новую пару не дает). 
#? Ввод: 300
#? Вывод: 220 284